# config/material_map.py

MATERIAL_ALIASES = {
    "brick": "벽돌", "벽돌": "벽돌",
    "concrete": "콘크리트", "콘크리트": "콘크리트",
    "foam": "스티로폼", "스티로폼": "스티로폼",
    "general_w": "잡자재", "잡자재": "잡자재",
    "gypsum board": "석고보드", "석고보드": "석고보드",
    "pipes": "파이프", "pipe": "파이프", "파이프": "파이프",
    "plastic": "플라스틱", "플라스틱": "플라스틱",
    "stone": "석재", "돌": "석재", "석재": "석재",
    "tile": "타일", "타일": "타일",
    "wood": "목재", "나무": "목재", "목재": "목재"
}

MATERIAL_TO_WASTE = {
    "벽돌": {"type": "폐벽돌", "factor": 200},
    "콘크리트": {"type": "폐콘크리트", "factor": 300},
    "스티로폼": {"type": "폐합성수지", "factor": 180},
    "잡자재": {"type": "혼합건설폐기물", "factor": 500},
    "석고보드": {"type": "폐보드류", "factor": 500},
    "파이프": {"type": "폐금속류", "factor": 150},
    "플라스틱": {"type": "폐합성수지", "factor": 180},
    "석재": {"type": "폐석재", "factor": 250},
    "타일": {"type": "폐타일 및 폐도자기", "factor": 250},
    "목재": {"type": "폐목재", "factor": 400}
}
